In [1]:
import pandas as pd
import re

In [2]:
heroes = pd.read_csv("../data/heroes.csv")
heroes.head()

   id            name       role    type
0   1       Anti-Mage      Carry   Melee
1   2             Axe  Initiator   Melee
2   3            Bane    Support  Ranged
3   4     Bloodseeker      Carry   Melee
4   5  Crystal Maiden    Support  Ranged

In [3]:
data = pd.read_csv("../matchesdata/0-860.csv")
data.head()

     match_id victor_team     radiant_team         dire_team
0  4935182858        Dire  55-106-19-18-79     71-1-21-85-23
1  4912193975     Radiant    71-65-74-2-42    55-92-6-111-62
2  4939511813        Dire     36-7-75-6-85     21-96-45-5-17
3  4910831000        Dire    87-42-2-23-71  111-19-52-114-80
4  4926760335        Dire  86-43-106-65-75   39-121-31-69-42

In [4]:
data["radiant_team"] = data["radiant_team"].str.split("-")
data["dire_team"] = data["dire_team"].str.split("-")
data.head()

     match_id victor_team           radiant_team               dire_team
0  4935182858        Dire  [55, 106, 19, 18, 79]     [71, 1, 21, 85, 23]
1  4912193975     Radiant    [71, 65, 74, 2, 42]    [55, 92, 6, 111, 62]
2  4939511813        Dire     [36, 7, 75, 6, 85]     [21, 96, 45, 5, 17]
3  4910831000        Dire    [87, 42, 2, 23, 71]  [111, 19, 52, 114, 80]
4  4926760335        Dire  [86, 43, 106, 65, 75]   [39, 121, 31, 69, 42]

In [5]:
data = data.explode("radiant_team")
data = data.explode("dire_team")

In [6]:
data

       match_id victor_team radiant_team dire_team
0    4935182858        Dire           55        71
0    4935182858        Dire           55         1
0    4935182858        Dire           55        21
0    4935182858        Dire           55        85
0    4935182858        Dire           55        23
..          ...         ...          ...       ...
859  4936555257     Radiant           69       121
859  4936555257     Radiant           69        61
859  4936555257     Radiant           69       119
859  4936555257     Radiant           69        38
859  4936555257     Radiant           69       106

[21500 rows x 4 columns]

In [8]:
radiantss = (data.loc[data["victor_team"] == "Radiant"]
                .groupby(["radiant_team", "dire_team"])
                .agg(win_count=("dire_team", "count"))
                .reset_index()
                .rename(columns={"radiant_team": "winner", "dire_team": "loser"}))
radiantss

     winner loser  win_count
0         1    10          3
1         1   100          1
2         1   101          1
3         1   104          2
4         1   106          2
...     ...   ...        ...
5513     99    93          5
5514     99    95          1
5515     99    96          3
5516     99    97          1
5517     99    98          3

[5518 rows x 3 columns]